#include "mino.h"

#define ARR_SIZE 14
void init_mino(Mino *pmino) {
    pmino->dir = 0;
    pmino->h = INITH;
    pmino->w = INITW;
}

const char Iarray[4][4][2] = {
    {{2, 0}, {2, 1}, {2, 2}, {2, 3}},
    {{0, 2}, {1, 2}, {2, 2}, {3, 2}},
    {{1, 0}, {1, 1}, {1, 2}, {1, 3}},
    {{0, 1}, {1, 1}, {2, 1}, {3, 1}}
};

const char Oarray[4][4][2] = {
    {{2, 1}, {2, 2}, {3, 1}, {3, 2}},
    {{2, 1}, {2, 2}, {3, 1}, {3, 2}},
    {{2, 1}, {2, 2}, {3, 1}, {3, 2}},
    {{2, 1}, {2, 2}, {3, 1}, {3, 2}},
};

const char Sarray[4][4][2] = {
    {{2, 0}, {2, 1}, {3, 1}, {3, 2}},
    {{1, 2}, {2, 1}, {2, 2}, {3, 1}},
    {{1, 0}, {1, 1}, {2, 1}, {2, 2}},
    {{1, 1}, {2, 0}, {2, 1}, {3, 0}}
};

const char Zarray[4][4][2] = {
    {{2, 1}, {2, 2}, {3, 0}, {3, 1}},
    {{1, 1}, {2, 1}, {2, 2}, {3, 2}},
    {{1, 1}, {1, 2}, {2, 0}, {2, 1}},
    {{1, 0}, {2, 0}, {2, 1}, {3, 1}}
};

const char Jarray[4][4][2] = {
    {{2, 0}, {2, 1}, {2, 2}, {3, 0}},
    {{1, 1}, {2, 1}, {3, 1}, {3, 2}},
    {{1, 2}, {2, 0}, {2, 1}, {2, 2}},
    {{1, 0}, {1, 1}, {2, 1}, {3, 1}}
};

const char Larray[4][4][2] = {
    {{2, 0}, {2, 1}, {2, 2}, {3, 2}},
    {{1, 1}, {1, 2}, {2, 1}, {3, 1}},
    {{1, 0}, {2, 0}, {2, 1}, {2, 2}},
    {{1, 1}, {2, 1}, {3, 0}, {3, 1}}
};

const char Tarray[4][4][2] = {
    {{2, 0}, {2, 1}, {2, 2}, {3, 1}},
    {{1, 1}, {2, 1}, {2, 2}, {3, 1}},
    {{1, 1}, {2, 0}, {2, 1}, {2, 2}},
    {{1, 1}, {2, 0}, {2, 1}, {3, 1}}
};

/* SRSのズレの一覧配列,8の内0, 1, 2, 3は
それぞれの向きからの時計回り回転時のoffset、
4, 5, 6, 7はそれぞれ0, 1, 2, 3の向きからの
半時計回り回転時のoffset */
const char Ioffsets[8][5][2] = {
    {{0, 0}, {0, -2}, {0, 1}, {-1, -2}, {2, 1}},
    {{0, 0}, {0, -1}, {0, 2}, {2, -1}, {-1, 2}},
    {{0, 0}, {0, 2}, {0, -1}, {1, 2}, {-2, -1}},
    {{0, 0}, {0, -2}, {0, 1}, {-2, 1}, {1, -2}},
    {{0, 0}, {0, -1}, {0, 2}, {2, -1}, {-1, 2}},
    {{0, 0}, {0, 2}, {0, -1}, {1, 2}, {-2, -1}},
    {{0, 0}, {0, 1}, {0, -2}, {-2, 1}, {1, -2}},
    {{0, 0}, {0, 1}, {0, -2}, {-1, -2}, {2, 1}},
};

const char NOTIoffsets[8][5][2] = {
    {{0, 0}, {0, -1}, { 1, -1}, {-2, 0}, {-2, -1}},
    {{0, 0}, {0,  1}, {-1,  1}, { 2, 0}, { 2,  1}},
    {{0, 0}, {0,  1}, { 1,  1}, {-2, 0}, {-2,  1}},
    {{0, 0}, {0, -1}, {-1, -1}, { 2, 0}, { 2, -1}},
    {{0, 0}, {0,  1}, { 1,  1}, {-2, 0}, {-2,  1}},
    {{0, 0}, {0,  1}, {-1,  1}, { 2, 0}, { 2,  1}},
    {{0, 0}, {0, -1}, { 1, -1}, {-2, 0}, {-2, -1}},
    {{0, 0}, {0, -1}, {-1, -1}, { 2, 0}, { 2, -1}},
};

const char (*MINOSarray[16])[4][2];
void init_MINOSarray(void) {
    MINOSarray[IMINO] = Iarray;
    MINOSarray[OMINO] = Oarray;
    MINOSarray[SMINO] = Sarray;
    MINOSarray[ZMINO] = Zarray;
    MINOSarray[JMINO] = Jarray;
    MINOSarray[LMINO] = Larray;
    MINOSarray[TMINO] = Tarray;
}

const char (*SRSoffsets[16])[5][2];
void init_SRSoffsets(void) {
    SRSoffsets[IMINO] = Ioffsets;
    SRSoffsets[OMINO] = NOTIoffsets;
    SRSoffsets[SMINO] = NOTIoffsets;
    SRSoffsets[ZMINO] = NOTIoffsets;
    SRSoffsets[JMINO] = NOTIoffsets;
    SRSoffsets[LMINO] = NOTIoffsets;
    SRSoffsets[TMINO] = NOTIoffsets;
}

struct NEXTS {
    /* 内部的なNEXT配列,キューとして使用する
    少なくともゲーム中表示される数+7の
    サイズを確保しなければならない */
    int Narray[ARR_SIZE];

} Nexts;
